Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/iperf_demo/src/packs/WBZ653_DFP/component/pfw.h
/* -------- PFW_DFT_VALP2RR23 : (PFW Offset: 0x150) (R/W 32)  -------- */
#define PFW_DFT_VALP2RR23_RESETVALUE          _UINT32_(0x00)                                       /*  (PFW_DFT_VALP2RR23)   Reset Value */

#define PFW_DFT_VALP2RR23_PR2RR2_Pos          _UINT32_(0)                                          /* (PFW_DFT_VALP2RR23)  Position */
#define PFW_DFT_VALP2RR23_PR2RR2_Msk          (_UINT32_(0xFFFF) << PFW_DFT_VALP2RR23_PR2RR2_Pos)   /* (PFW_DFT_VALP2RR23)  Mask */
#define PFW_DFT_VALP2RR23_PR2RR2(value)       (PFW_DFT_VALP2RR23_PR2RR2_Msk & (_UINT32_(value) << PFW_DFT_VALP2RR23_PR2RR2_Pos)) /* Assigment of value for PR2RR2 in the PFW_DFT_VALP2RR23 register */
#define PFW_DFT_VALP2RR23_P2RR3_Pos           _UINT32_(16)                                         /* (PFW_DFT_VALP2RR23)  Position */
#define PFW_DFT_VALP2RR23_P2RR3_Msk           (_UINT32_(0xFFFF) << PFW_DFT_VALP2RR23_P2RR3_Pos)    /* (PFW_DFT_VALP2RR23)  Mask */
#define PFW_DFT_VALP2RR23_P2RR3(value)        (PFW_DFT_VALP2RR23_P2RR3_Msk & (_UINT32_(value) << PFW_DFT_VALP2RR23_P2RR3_Pos)) /* Assigment of value for P2RR3 in the PFW_DFT_VALP2RR23 register */
#define PFW_DFT_VALP2RR23_Msk                 _UINT32_(0xFFFFFFFF)                                 /* (PFW_DFT_VALP2RR23) Register Mask  */


/* -------- PFW_DFT_VALP2RR45 : (PFW Offset: 0x160) (R/W 32)  -------- */
#define PFW_DFT_VALP2RR45_RESETVALUE          _UINT32_(0x00)                                       /*  (PFW_DFT_VALP2RR45)   Reset Value */

#define PFW_DFT_VALP2RR45_PR2RR4_Pos          _UINT32_(0)                                          /* (PFW_DFT_VALP2RR45)  Position */
#define PFW_DFT_VALP2RR45_PR2RR4_Msk          (_UINT32_(0xFFFF) << PFW_DFT_VALP2RR45_PR2RR4_Pos)   /* (PFW_DFT_VALP2RR45)  Mask */
#define PFW_DFT_VALP2RR45_PR2RR4(value)       (PFW_DFT_VALP2RR45_PR2RR4_Msk & (_UINT32_(value) << PFW_DFT_VALP2RR45_PR2RR4_Pos)) /* Assigment of value for PR2RR4 in the PFW_DFT_VALP2RR45 register */
#define PFW_DFT_VALP2RR45_P2RR5_Pos           _UINT32_(16)                                         /* (PFW_DFT_VALP2RR45)  Position */
#define PFW_DFT_VALP2RR45_P2RR5_Msk           (_UINT32_(0xFFFF) << PFW_DFT_VALP2RR45_P2RR5_Pos)    /* (PFW_DFT_VALP2RR45)  Mask */
#define PFW_DFT_VALP2RR45_P2RR5(value)        (PFW_DFT_VALP2RR45_P2RR5_Msk & (_UINT32_(value) << PFW_DFT_VALP2RR45_P2RR5_Pos)) /* Assigment of value for P2RR5 in the PFW_DFT_VALP2RR45 register */
#define PFW_DFT_VALP2RR45_Msk                 _UINT32_(0xFFFFFFFF)                                 /* (PFW_DFT_VALP2RR45) Register Mask  */


/* -------- PFW_DFT_VALP2RR67 : (PFW Offset: 0x170) (R/W 32)  -------- */
#define PFW_DFT_VALP2RR67_RESETVALUE          _UINT32_(0x00)                                       /*  (PFW_DFT_VALP2RR67)   Reset Value */

#define PFW_DFT_VALP2RR67_PR2RR6_Pos          _UINT32_(0)                                          /* (PFW_DFT_VALP2RR67)  Position */
#define PFW_DFT_VALP2RR67_PR2RR6_Msk          (_UINT32_(0xFFFF) << PFW_DFT_VALP2RR67_PR2RR6_Pos)   /* (PFW_DFT_VALP2RR67)  Mask */
#define PFW_DFT_VALP2RR67_PR2RR6(value)       (PFW_DFT_VALP2RR67_PR2RR6_Msk & (_UINT32_(value) << PFW_DFT_VALP2RR67_PR2RR6_Pos)) /* Assigment of value for PR2RR6 in the PFW_DFT_VALP2RR67 register */
#define PFW_DFT_VALP2RR67_P2RR7_Pos           _UINT32_(16)                                         /* (PFW_DFT_VALP2RR67)  Position */
#define PFW_DFT_VALP2RR67_P2RR7_Msk           (_UINT32_(0xFFFF) << PFW_DFT_VALP2RR67_P2RR7_Pos)    /* (PFW_DFT_VALP2RR67)  Mask */
#define PFW_DFT_VALP2RR67_P2RR7(value)        (PFW_DFT_VALP2RR67_P2RR7_Msk & (_UINT32_(value) << PFW_DFT_VALP2RR67_P2RR7_Pos)) /* Assigment of value for P2RR7 in the PFW_DFT_VALP2RR67 register */
#define PFW_DFT_VALP2RR67_Msk                 _UINT32_(0xFFFFFFFF)                                 /* (PFW_DFT_VALP2RR67) Register Mask  */


/** \brief PFW register offsets definitions */
#define PFW_IFT_CON_REG_OFST           _UINT32_(0x00)      /* (PFW_IFT_CON)  Offset */
#define PFW_IFT_CRCCON_REG_OFST        _UINT32_(0x10)      /* (PFW_IFT_CRCCON)  Offset */
#define PFW_IFT_CRCMADR_REG_OFST       _UINT32_(0x20)      /* (PFW_IFT_CRCMADR)  Offset */
#define PFW_IFT_CRCMLEN_REG_OFST       _UINT32_(0x30)      /* (PFW_IFT_CRCMLEN)  Offset */
#define PFW_IFT_CRCIV_REG_OFST         _UINT32_(0x40)      /* (PFW_IFT_CRCIV)  Offset */
#define PFW_IFT_CRCACC_REG_OFST        _UINT32_(0x50)      /* (PFW_IFT_CRCACC)  Offset */
#define PFW_IFT_CRCPOLY_REG_OFST       _UINT32_(0x60)      /* (PFW_IFT_CRCPOLY)  Offset */
#define PFW_IFT_CRCFXOR_REG_OFST       _UINT32_(0x70)      /* (PFW_IFT_CRCFXOR)  Offset */
#define PFW_IFT_CRCSUM_REG_OFST        _UINT32_(0x80)      /* (PFW_IFT_CRCSUM)  Offset */
#define PFW_IFT_ECCCON_REG_OFST        _UINT32_(0x90)      /* (PFW_IFT_ECCCON)  Offset */
#define PFW_IFT_ECCFLT_REG_OFST        _UINT32_(0xA0)      /* (PFW_IFT_ECCFLT)  Offset */
#define PFW_IFT_ECCADR_REG_OFST        _UINT32_(0xB0)      /* (PFW_IFT_ECCADR)  Offset */
#define PFW_IFT_ECCPAR_REG_OFST        _UINT32_(0xC0)      /* (PFW_IFT_ECCPAR)  Offset */
#define PFW_IFT_ECCSYN_REG_OFST        _UINT32_(0xD0)      /* (PFW_IFT_ECCSYN)  Offset */
#define PFW_DFT_VALCON_REG_OFST        _UINT32_(0xF0)      /* (PFW_DFT_VALCON)  Offset */
#define PFW_DFT_VALP1RR01_REG_OFST     _UINT32_(0x100)     /* (PFW_DFT_VALP1RR01)  Offset */
#define PFW_DFT_VALP1RR23_REG_OFST     _UINT32_(0x110)     /* (PFW_DFT_VALP1RR23)  Offset */
#define PFW_DFT_VALP1RR45_REG_OFST     _UINT32_(0x120)     /* (PFW_DFT_VALP1RR45)  Offset */
#define PFW_DFT_VALP1RR67_REG_OFST     _UINT32_(0x130)     /* (PFW_DFT_VALP1RR67)  Offset */
#define PFW_DFT_VALP2RR01_REG_OFST     _UINT32_(0x140)     /* (PFW_DFT_VALP2RR01)  Offset */
#define PFW_DFT_VALP2RR23_REG_OFST     _UINT32_(0x150)     /* (PFW_DFT_VALP2RR23)  Offset */
#define PFW_DFT_VALP2RR45_REG_OFST     _UINT32_(0x160)     /* (PFW_DFT_VALP2RR45)  Offset */
#define PFW_DFT_VALP2RR67_REG_OFST     _UINT32_(0x170)     /* (PFW_DFT_VALP2RR67)  Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief PFW register API structure */
typedef struct
{  /* flash wrapper */
  __IO  uint32_t                       PFW_IFT_CON;        /**< Offset: 0x00 (R/W  32)  */
  __I   uint8_t                        Reserved1[0x0C];
  __IO  uint32_t                       PFW_IFT_CRCCON;     /**< Offset: 0x10 (R/W  32)  */
  __I   uint8_t                        Reserved2[0x0C];
  __IO  uint32_t                       PFW_IFT_CRCMADR;    /**< Offset: 0x20 (R/W  32)  */
  __I   uint8_t                        Reserved3[0x0C];
  __IO  uint32_t                       PFW_IFT_CRCMLEN;    /**< Offset: 0x30 (R/W  32)  */
  __I   uint8_t                        Reserved4[0x0C];
  __IO  uint32_t                       PFW_IFT_CRCIV;      /**< Offset: 0x40 (R/W  32)  */
  __I   uint8_t                        Reserved5[0x0C];
  __IO  uint32_t                       PFW_IFT_CRCACC;     /**< Offset: 0x50 (R/W  32)  */
  __I   uint8_t                        Reserved6[0x0C];
  __IO  uint32_t                       PFW_IFT_CRCPOLY;    /**< Offset: 0x60 (R/W  32)  */
  __I   uint8_t                        Reserved7[0x0C];
  __IO  uint32_t                       PFW_IFT_CRCFXOR;    /**< Offset: 0x70 (R/W  32)  */
  __I   uint8_t                        Reserved8[0x0C];
  __IO  uint32_t                       PFW_IFT_CRCSUM;     /**< Offset: 0x80 (R/W  32)  */
  __I   uint8_t                        Reserved9[0x0C];
  __IO  uint32_t                       PFW_IFT_ECCCON;     /**< Offset: 0x90 (R/W  32)  */
  __I   uint8_t                        Reserved10[0x0C];
  __IO  uint32_t                       PFW_IFT_ECCFLT;     /**< Offset: 0xA0 (R/W  32)  */
  __I   uint8_t                        Reserved11[0x0C];
  __IO  uint32_t                       PFW_IFT_ECCADR;     /**< Offset: 0xB0 (R/W  32)  */
  __I   uint8_t                        Reserved12[0x0C];
  __IO  uint32_t                       PFW_IFT_ECCPAR;     /**< Offset: 0xC0 (R/W  32)  */
  __I   uint8_t                        Reserved13[0x0C];
  __IO  uint32_t                       PFW_IFT_ECCSYN;     /**< Offset: 0xD0 (R/W  32)  */
  __I   uint8_t                        Reserved14[0x1C];
  __IO  uint32_t                       PFW_DFT_VALCON;     /**< Offset: 0xF0 (R/W  32)  */
  __I   uint8_t                        Reserved15[0x0C];
  __IO  uint32_t                       PFW_DFT_VALP1RR01;  /**< Offset: 0x100 (R/W  32)  */
  __I   uint8_t                        Reserved16[0x0C];
  __IO  uint32_t                       PFW_DFT_VALP1RR23;  /**< Offset: 0x110 (R/W  32)  */
  __I   uint8_t                        Reserved17[0x0C];
  __IO  uint32_t                       PFW_DFT_VALP1RR45;  /**< Offset: 0x120 (R/W  32)  */
  __I   uint8_t                        Reserved18[0x0C];
  __IO  uint32_t                       PFW_DFT_VALP1RR67;  /**< Offset: 0x130 (R/W  32)  */
  __I   uint8_t                        Reserved19[0x0C];
  __IO  uint32_t                       PFW_DFT_VALP2RR01;  /**< Offset: 0x140 (R/W  32)  */
  __I   uint8_t                        Reserved20[0x0C];
  __IO  uint32_t                       PFW_DFT_VALP2RR23;  /**< Offset: 0x150 (R/W  32)  */
  __I   uint8_t                        Reserved21[0x0C];
  __IO  uint32_t                       PFW_DFT_VALP2RR45;  /**< Offset: 0x160 (R/W  32)  */
  __I   uint8_t                        Reserved22[0x0C];
  __IO  uint32_t                       PFW_DFT_VALP2RR67;  /**< Offset: 0x170 (R/W  32)  */
} pfw_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _WBZ65_PFW_COMPONENT_H_ */
